IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
	WORKING-STORAGE SECTION.
		01 MY-DATA1 PIC X(20).
		01 MY-DATA2 PIC 9(5).
		01 MY-DATA3 PIC 999V99.
		01 MY-DATA4 PIC 99999 VALUE 130.
PROCEDURE DIVISION.
	MAIN SECTION.
		MOVE 'HELLO WORLD' TO MY-DATA1.
		MOVE 120 TO MY-DATA2.
		MOVE 120.55 TO MY-DATA3.
		DISPLAY MY-DATA1.
		DISPLAY MY-DATA2.
		DISPLAY MY-DATA3.
		DISPLAY MY-DATA4.
		STOP RUN.